{{{header(core/install,Richard Westhaver,ellis@rwest.io,core installation
guide)}}} 

The core is distributed via our public package registry:
[[https://packy.compiler.company][packy.compiler.company]]. You can install any part of the core - from a
complete Linux system to individual packages. Refer to the packy
documentation for details.

The simplest way to get started is by getting the installer for your
platform with the following script:

#+begin_src shell :results pp replace :exports both :noeval t
curl --proto '=https' --tlsv1.2 -sSf https://packy.compiler.company/do/init.sh | sh # -s -- --help
#+end_src

#+RESULTS:
#+begin_example

cc-init 0.1.0-0941fa04c53d+

Usage: cc-init [OPTIONS]

Options:
  -y              Disable confirmation prompts
  -l, --level...  Set the log level
  -h, --help      Print help
  -V, --version   Print version
#+end_example
* TODO Packages
- State "TODO"       from              [2023-11-25 Sat 18:28]
** Crates                                                              :rust:
** ELPA                                                               :emacs:
** Quicklisp                                                           :lisp:
** AUR                                                               :pacman:
* Images
We also ship FASL images for Lisp. These images can be downloaded and
loaded using the =--core= option of your lisp compiler like so:

#+begin_src shell
sbcl --core std.core
#+end_src

See [[https://www.sbcl.org/manual/#FASL-Format][FASL Format]] for details. Keep in mind that the FASL format is not
portable - they are tied to a specific version of the compiler and we
don't keep old versions around for long.
* Apps
** Lisp
*** skel
#+begin_src shell :results pp replace :exports code
  sbcl --noinform  --non-interactive \
    --eval '(ql:quickload :bin/skel)' \
    --eval "(asdf:make :bin/skel)"
  mv lisp/app/bin/skel ~/.local/bin/
#+end_src

#+RESULTS:
: To load "bin/skel":
:   Load 1 ASDF system:
:     bin/skel
: ; Loading "bin/skel"
: .......
: compressed 32768 bytes into 5079 at level 9
: compressed 236388352 bytes into 9579898 at level 9
: compressed 8552448 bytes into 2637947 at level 9
: compressed 0 bytes into 9 at level 9

*** organ
#+begin_src shell :results pp replace :exports code
  sbcl --noinform  --non-interactive \
    --eval '(ql:quickload :bin/organ)' \
    --eval "(asdf:make :bin/organ)"
  mv lisp/app/bin/organ ~/.local/bin/
#+end_src

#+RESULTS:
#+begin_example
To load "bin/organ":
  Load 1 ASDF system:
    bin/organ
; Loading "bin/organ"
..................................................
[package bin/organ].
compressed 32768 bytes into 5088 at level 9
compressed 236388352 bytes into 9364780 at level 9
compressed 8355840 bytes into 2588308 at level 9
compressed 0 bytes into 9 at level 9
#+end_example

*** rdb
#+begin_src shell :results pp replace :exports code
  sbcl --noinform  --non-interactive \
    --eval '(ql:quickload :bin/rdb)' \
    --eval "(asdf:make :bin/rdb)"
  mv lisp/app/bin/rdb ~/.local/bin/
#+end_src

#+RESULTS:
: To load "bin/rdb":
:   Load 1 ASDF system:
:     bin/rdb
: ; Loading "bin/rdb"
: ....
: compressed 32768 bytes into 5071 at level 9
: compressed 236388352 bytes into 9386823 at level 9
: compressed 8421376 bytes into 2593084 at level 9
: compressed 0 bytes into 9 at level 9

*** homer
#+begin_src shell :results pp replace :exports code
  sbcl --noinform  --non-interactive \
    --eval '(ql:quickload :bin/homer)' \
    --eval "(asdf:make :bin/homer)"
  mv lisp/app/bin/homer ~/.local/bin/
#+end_src

#+RESULTS:
#+begin_example
To load "bin/homer":
  Load 1 ASDF system:
    bin/homer
; Loading "bin/homer"
..................................................
[package bin/homer].
compressed 32768 bytes into 5094 at level 9
compressed 236388352 bytes into 9586720 at level 9
compressed 8552448 bytes into 2634135 at level 9
compressed 0 bytes into 9 at level 9
#+end_example

*** packy
#+begin_src shell :results pp replace :exports code
  sbcl --noinform  --non-interactive \
    --eval '(ql:quickload :bin/packy)' \
    --eval "(asdf:make :bin/packy)"
  mv lisp/app/bin/packy ~/.local/bin/
#+end_src

#+RESULTS:
#+begin_example
To load "bin/packy":
  Load 1 ASDF system:
    bin/packy
; Loading "bin/packy"
..................................................
[package packy]...................................
[package bin/packy].
compressed 32768 bytes into 5086 at level 9
compressed 236388352 bytes into 9303422 at level 9
compressed 8323072 bytes into 2579589 at level 9
compressed 0 bytes into 9 at level 9
#+end_example
** Rust
*** cc-init
#+begin_src shell :results output pp :exports code
  cd rust/app/cli/cc-init && cargo install --path .
#+end_src

#+RESULTS:

*** tz
#+begin_src shell :results output pp :exports code
  cd rust/app/cli/tz && cargo install --path .
#+end_src

#+RESULTS:

*** mailman
#+begin_src shell :results output pp :exports code
  cd rust/app/cli/cc-install && cargo install --path .
#+end_src

#+RESULTS:

*** krypt
#+begin_src shell :results output pp :exports code
  cd rust/app/cli/krypt && cargo install --path .
#+end_src

#+RESULTS:

* Source
